app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def index
    @contacts = Contact.all

INSERT INTO "contacts" ("firstname", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["firstname", "Mario"], ["lastname", "Zanoti"], ["created_at", "2021-08-19 15:52:56.016891"], ["updated_at", "2021-08-19 15:52:56.016891"]]
---
 def create
    contact = Contact.create(contact_params)

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @contact = Contact.find(params[:id])

UPDATE "contacts" SET "fullname" = ?, "address" = ?, "email" = ?, "mobile_phone_number" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["fullname", "Mr Juan Conepa"], ["address", ""], ["email", ""], ["mobile_phone_number", ""], ["updated_at", "2021-08-19 16:19:02.623755"], ["id", 5]]
---
  def update
    @contact.update(contact_params)

DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 4]]
---
  def destroy
    @contact.destroy

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def current_contact
    @contact = Contact.find(params[:id])